#+STARTUP: indent
#+STARTUP: overview
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
*** Variable Bindings

- Variables :: x y z etc
- Expressions/terms :: 10 , 5 + 2, can be a variable
- Values :: are expressions that are in their "simplest" form.
- Environment :: is a function from Variables to values.

When an expression is a value ?

Values ⊆ Expressions

The programming model for sml is the following :


1. The program consists of a sequence of /variable bindings/.

2. A variable binding looks like ~val <variable> = <expr>~

3. A subset of expressions are called /Values/. These are
   those expressions that are in the simplest form.

4. The SML language when it encounters a binding ~val x = e~,
   evaluates (tries to) the Right Hand Side e of the binding (which is
   an expression) to its simplified form (which is a value) ~v~. And
   then it updates the /environment/ by binding the variable to ~x~ to
   ~v~. At this point of "time" we say that the variable x is /bound/
   to the value v.





#+BEGIN_SRC sml

   (* Environment is stdlib + {}*)
   val x = 10     (* Binds the variable x to the value 10 *)

   (* Environment becomes stdlib + {x = 10} *)

   val y = 5 + 2  (* RHS = 5 + 2 (expression) ----> 7 (value)
                       Bind the value 7 to y
                  ,*)
    (* Env = stlib + { x =10 ; y = 7 }  *)


   val z = x + y  (* RHS is not value.
                      x + y ----> 10 + y (substitution of x)
                            ----> 10 + 7 (substitution of y)
                            ----> 17
                      Binds z to 17
                      ,*)

  (* Env = stdlib + {x = 10 ; y = 7; z = 17 *)

   val amitabbachan = "Big B"

   val z1 = amitabbachan
   (* Env = ? *)

#+END_SRC

#+RESULTS:
: val x = 10 : int
: val y = 7 : int
: val z = 17 : int
: val amitabbachan = "Big B" : string
: val z1 = "Big B" : string

** Hello world

#+BEGIN_SRC sml

val x = print "Hello World\n"

#+END_SRC

#+RESULTS:
: Hello World
: val x = () : unit

** Side effects and pure expressions.

#+BEGIN_SRC sml

val x = print "hello\n"  (* Prints the string "hello" as a side effect *)
val y = ()
val z = x (* No side effect as () is a value and
             hence need no reduction *)

val z = () (* This is equivalent to the above binding *)

(*

 print "hello\n" (expression)
   ----> ()

In the process there is a side effect of
printing the "hello\n"

*)

#+END_SRC

#+RESULTS:
: hello
: val x = () : unit

Certain expressions on reduction has side effects
e.g = ~print "hello\n"~ . Evaluating it has an effect on
the outside world.


Those Expressions whose evaluation  do not have side effect is
called a /pure expression/

1. ~print "hello"~ is an expression that is /not/ a value
2. It reduces to the value ~()~
3. The reduction has the side effect of printing "hello"
4. However, the resulting value ~()~ has no side effect.


An expression ~e~ which reduces to a value ~v~ is said to be /pure/
if every binding of the form ~val x = e~ can be replaced by the binding
~val x = v~ without changing the behaviour of the program.

Any expression that does not have the above property is said to have
"side-effects".

** Unit

1. Type called ~unit~
2. It has only one value ~()~ (call this unit, void)

#+BEGIN_SRC sml
fun identity x  = x
fun hello ()   = print "hello\n"
fun hello1 x   = print "hello1\n"
val z          = hello () (* --> (1) *)
val u = identity 10
val v = identity "hello"
val u1 = hello1 42        (* --> (2) *)
val u2 = hello1 "hello"   (* --> (3) *)
val _  = hello ()
val _  = print "This is just printing without binding\n"

#+END_SRC

#+RESULTS:
#+begin_example
hello
hello1
hello1
hello
This is just printing without binding
val identity = fn : 'a -> 'a
val hello = fn : unit -> unit
val hello1 = fn : 'a -> unit
val z = () : unit
val u = 10 : int
val v = "hello" : string
val u1 = () : unit
val u2 = () : unit
#+end_example





* Pattern matching

#+begin_src sml
   val x = 10      (* an equantion that says in this context x is 10 *)
   fun f x = x+1   (* we say f is that function that satisfies f x = x + 1 *)
   fun konst _ = 10
   fun first (x, _) = x (* I have used variable pattern, wild card and tuple pattern *)

   fun foo ( _ , _ , y) = y + 1


   (*
      fun foo p = ... where p is the pattern (p₁, p₂)  p: 'a * b where p₁ : 'a, p₂ : 'b
                            p₁ is the pattern (p₁₁, p₁₂)  'a = 'a₁ * 'a₂
                            p₁₁ and p₁₂ are both _

                            p₂ is the pattern y : 'b , 'b has to be int because RHS has y + 1
                              RHS type is 'c so 'c and 'b has to be type int

     foo : ('a₁ * 'a₂) * int -> int

     foo : A * B -> C  where A = 'a₁ * 'a₂

     foo : A * B * C -> D
  ,*)

   fun bar (   _   , y) = y + 1

   (* length : 'a list -> int *)
   (* fun length (xs : 'a list) = ... : int *)
   fun length []        = 0
     | length (_ :: ps) = 1 + length ps

   (* map f [x₁,....,xₙ] = [ f x₁ , f x₂ , .... , f xₙ ]

      map : 'a ->           'b           -> 'c
      map : ('a₁ -> 'a₂) -> 'b₁ list     ->'c₁ list
      map : ('a₁ -> 'a₂) -> 'a₁ list     -> 'a₂ list
      map : ('a -> 'b) -> 'a list -> 'b list

    ,*)
   (* fun map f xs = ....  *)
   fun map f (p :: ps) = f p :: map f ps
     | map _ []        = []

#+end_src

#+RESULTS:
: val x = 10 : int
: val f = fn : int -> int
: val konst = fn : 'a -> int
: val first = fn : 'a * 'b -> 'a
: val foo = fn : 'a * 'b * int -> int
: val bar = fn : 'a * int -> int

Patterns

We define what are patterns. A pattern on the LHS servers two purposes In an equation
like ~fun f p = e~ , p restrict the allowed values to certain forms and also leads
to variable binding. We call this process "pattern matching"




1. A variable :: A variable pattern ~x~ matches any value (of appropriate type) and binds
   x to it for use in RHS

2. A wild card  i.e ~_~.  The wild card patter ~_~ matches any value but that value is not
   available as binding on the RHS. One uses a wild card when one does not care about the value.

** Recap

We briefly discussed pattern matching and how to use it to define
functions.

#+begin_example sml
  val x     = expr
  fun f x y = exp

  (* The general form of bindings *)
  val pat = expr  (*
                    1. expr is reduced to a value  say v
                    2. v is matched with the pattern pat
                    3. If the match failed it is a runtime error
                       (typically due to non-exhaustive pattern matching )
                    4. If the pattern pat matches with v the associated bindings
                       are done at the top level.
                       *)

  fun f p₁₁ ... p₁ₙ = e₁
    | f p₂₁ ... p₂ₙ = e₂
    | ....
	| f pₘ₁ ... pₘₙ = eₘ

  val x = let val pat = e1    (* Only applicable within this let and the
                                 associated expression betwen "in" and "end"
                              *)
              fun f p1 = e2
          in
             exp
          end


#+end_example

#+begin_src sml
  val (x,y) = ("hello", 2)
  val _     = print "hello\n"
  val _     = 2
  fun head (x :: xs) = x
  (* val (x,_) = "hello"  (* This is an error because tuple pattern cannot match string *)  *)
  (* val x::xs  = []  (* This is a pattern match failure that manifest itself at run time *) *)
  val x :: xs = [1,2]

#+end_src

#+RESULTS:
#+begin_example
stdIn:28.5-28.20 Warning: binding not exhaustive
          x :: xs = ...
stdIn:25.5-25.23 Warning: match nonexhaustive
          x :: xs => ...

hello
val x = <hidden-value> : string
val y = 2 : int
val head = fn : 'a list -> 'a
val x = 1 : int
val xs = [2] : int list
#+end_example






*** What are the patterns of type ('a,'b,'c) Name ?

There are two possible patterns of type ('a, 'b, 'c) Name

1. ~C1~ is a pattern of type ~('a, 'b, 'c) Name~ and it matches only
   the value ~C1 : ('a,'b,'c) Name~.  No bindings are created as a result.

2. ~C2 p~ is a pattern of type ~('a,'b,'c) Name~ for all pattern ~p :
   τ~.  It matches all values of the kind ~C2 v~ where ~p~ matches
   ~v~. The resulting bindings are the bindings created out of the
   match of ~p~ with ~v~.


#+begin_src sml

  (* binary tree with nodes decorated by elements of type 'a *)
    datatype 'a Tree = Empty
                     | Node of 'a Tree * 'a * 'a Tree

                                (* inorder :  'a Tree -> 'a list  *)
    (* fun inorder t = ... *)
    fun inorder Empty             = ...
      | inorder (Node (lt,a,rt) ) = ...

    (* depth : 'a Tree -> int *)
    (* fun depth t = ... *)
    fun depth  Empty              = 0
      | depth (Node (lt, _, rt))  = let val dl = depth lt
                                        val dr = depth rt
                                    in  if dl > dr then dl + 1
                                        else dr + 1

#+end_src

#+RESULTS:
: datatype 'a Tree = Empty | Node of 'a Tree * 'a * 'a Tree


* Modular programming.
SCHEDULED: <2021-09-27 Mon>

Modular programming means break down the program into smaller
components which are separtely programmed, tested and linked together.

1. We want to control namespace

   #+begin_src sml
     val x = 10
   #+end_src

   i.  I want to be able to use the same names for different (but
       often similar things)

       In SML it is done by wrapping things inside a structure.

       #+begin_src sml
         structure A = struct
            val x = 10
         end (* end of structure A *)

         structure B = struct
            val x = "hello"
         end (* end of structure B *)

         val z1 = A.x
         val z2 = B.x
       #+end_src

       #+RESULTS:
       : structure A : sig val x : int end
       : structure B : sig val x : string end
       : val z1 = 10 : int
       : val z2 = "hello" : string

   ii. I should be able to say that a name (for example ~x~) in a
       context it means some particular ~x~ that has been defined.

       #+begin_src sml
         structure A = struct
            val x = 10
         end (* end of structure A *)

         structure B = struct
            val x = "hello"
         end (* end of structure B *)

         (* There is no x here only A.x and B.x *)

         open B
         val z1 = let open A
                     (*
                      Local bindings that are only valid
                        inside the expression between "in" and "end"
                          let
                               <val or fun bindings>
                          in

                            end
                      ,*)
                 in x + x  (* x comes from A *)
                 end

          val z2 = x (* This comes from B *)
          val z3 = A.

       #+end_src

       #+RESULTS:
       : structure A : sig val x : int end
       : structure B : sig val x : string end
       : opening B
       :   val x : string
       : val z1 = 20 : int
       : val z2 = "hello" : string
       : val z3 = 10 : int

   iii. Abstraction over modular structures. I should be able to build
        newer modular components based on other modular components.

        Point iii. is unique to SML (ocaml, Coq ....)

        For this SML introduces two important constructs namely signatures and functors.



**  Signatures

        #+begin_src sml

          structure A :
                    sig (* Hides y because it is not present in the signatures *)
                        val x : int
                    end
          = struct
            val x = 10
            val y = 100
          end


        #+end_src

        #+RESULTS:
        : structure A : sig val x : int end

        There are reasons to make sure that certain functions should not be exposed to
        the outside world.

        #+begin_src sml
          structure Counter :
                    sig
                        val incr : unit -> unit
                        val showValue : unit -> int
                    end =
          struct
               val ctrRef = ref 0
                     (* Counter implementation *)

               fun incr () = ()      (* silly increment not correct *)
               fun showValue () = 42 (* silly show value that always gives the answer *)
          end
        #+end_src

        #+RESULTS:
        : structure Counter :
        :   sig
        :     val incr : unit -> unit
        :     val showValue : unit -> int
        :   end


        Implementation of Binary search tree. Assumes that the "BST"
        property is true on all internal nodes. If you allow the user
        to "see" the actual type, they could potentially violate the
        property. So you would want to hide

        1. Functions, values etc

        2. And also types.


        #+begin_src sml
          structure A :  (* Transparent signature *)
                    sig type t
                        val pub : t
                    end
          = struct
               type t = int
               val pub = 42
               val prv = 100
          end
          val z = A.pub + A.pub

          structure B :>  (* Opaque/translucent signature *)
                    sig type t
                        type t1 = int
                        val pub : t
                            val pub1 : t1
                    end
          = struct
               type t = int
               type t1 = int
               val pub  = 42

               val pub1 = pub + pub
               val prv = 100
          end
          (* val z1 = B.pub + B.pub (* error *) *)
          val z11 = B.pub1 + B.pub1 (* not
                             an error *)
          val z2 = B.pub

        #+end_src

        #+RESULTS:
        #+begin_example
        structure A :
          sig
            type t = int
            val pub : t
          end
        val z = 84 : int
        structure B :
          sig
            type t
            type t1 = int
            val pub : t
            val pub1 : t1
          end
        val z11 = 168 : int
        val z2 = - : B.t
        #+end_example

        - NOTICE: In the result, A's signature mentions that A.t is
          int whereas B's signature does not mention it The reason for
          this difference is because of ":" vs ":>"



        Clearly by using the translucent signature (i.e using :>
        instead of :) scheme we can hide the data type behind BST and
        allow the creation of BST only through controlled interface.

** Functors

#+begin_src sml

   datatype ordering = LT | EQ | GT

   signature KEY = sig
     type key
     val compare : key -> key -> ordering
   end

   datatype 'a Tree = NullTree
                    | Node of 'a Tree * 'a * 'a Tree

   signature DICT = sig
     structure Key : KEY
     type key = Key.key
     type 'value t   (* this is your dictionary type
                            polymorphic in value that it stores against
                            key of type Key.key
                          ,*)
     val empty : 'a t
     val single : key -> 'a -> 'a t
     (* val insert : Key.key -> 'a -> 'a t -> 'a t *)
   end

   (* BST functor takes a structure of signature KEY and gives a structure of signature
      DICT.

     structure BST  :> DICT =
       struct

       end

      BST is a "function" that takes a structure K of signature KEY and "returns"
      a structure of signature DICT.

      compare it with something like this.
      fun foo (x : int) : int = x + 42

   ,*)
   functor BST ( K : KEY ) :> DICT
   = struct
        structure Key = K
        type key = Key.key

        (*
        type 'a t     =  (key * 'a) Tree  (* binary tree with nodes
                                                 decorated by elements of type key * 'a
	                                      *)

        ,*)
        datatype 'a t = Null
                      | Node of 'a t * (K.key *  'a) * 'a t

        val empty = Null
        fun single k a = Node (empty, k , a , empty)
   end

   functor ListDict ( K : Key) :> DICT
   = struct
        structure Key = K
        type key K.key
        type 'a t = (key, 'a) list
        val empty = []
        val single k a = [ (k,a) ]
   end

   structure IntKey : KEY = struct
      type key = int
      fun compare x y = if x < y then LT
                        else if x = y then EQ
                        else GT
   end

   structure IntDict = BST (IntKey)

                         (* IntDict is a polymorphic (in value)
                            dictionary data structure where the key is int
                             ,*)

   fun foo (x : int) : int = x + x
  val x = IntDict.empty

  (* val single : Key.key -> 'a -> 'a t  *)

  (* val y = IntDict.single 42 (* "The answer to Life, Universe and everything" *) *)


#+end_src

#+RESULTS:
#+begin_example
datatype ordering = EQ | GT | LT
signature KEY =
  sig
    type key
    val compare : key -> key -> ordering
  end
datatype 'a Tree = Node of 'a Tree * 'a * 'a Tree | NullTree
signature DICT =
  sig
    structure Key :
      sig
        type key
        val compare : key -> key -> ordering
      end
    type key = Key.key
    type 'a t
    val empty : 'a t
    val single : key -> 'a -> 'a t
  end
functor BST(K: sig
                 type key
                 val compare : key -> key -> ordering
               end) :
           sig
             structure Key : <sig>
             type key = Key.key
             type 'a t
             val empty : 'a t
             val single : key -> 'a -> 'a t
           end
structure IntKey : KEY
structure IntDict : DICT
val foo = fn : int -> int
val x = - : 'a IntDict.t
#+end_example


Analogy between modular programming and typed functional programming

| Modular programming     | Typed functional programming   |
|-------------------------+--------------------------------|
| structures              | values                         |
|-------------------------+--------------------------------|
| signatures              | types                          |
|                         |                                |
| interface of the        | types govern what can be done  |
| structure               | to/by values                   |
|                         |                                |
| specification of the    | specification of the value     |
| structure               |                                |
|-------------------------+--------------------------------|
| functors                | functions                      |
|                         |                                |
| Takes structures        |                                |
| to new structures       |                                |
|                         |                                |
| Interface is controlled | takes values of a specfic type |
| by the spec (signature) | to values of another type      |
| of the said structurres |                                |
|-------------------------+--------------------------------|


There are two levels in which you do functional programming

1. The usual values level

2. At the module level.

3. Both are "typed functional programming language". At the module
   level "values" are structures (modular structures), "types" are
   signatures and "functions" are functors.



** Key point of SML-style modules.


1. Any programming language can be equipped with a module system similar
   to SML. Unfortunately lot of the "modern" languages do not yet have
   anything even close to it.


2. Modules are zero cost abstractions. In fact mlton has a
   "defunctorisation step" where it actually "removes" all structures
   and modules.



#+begin_src C
   /* This is just a product type and has nothing to do with SML style structures (modulues)
   */
    struct A {
       int x;
       int y;
    };

#+end_src

#+begin_src sml
val u = { x = 10, y = 100 }  (* A product type int * int but with names for fields *)

#+end_src

#+RESULTS:
: val u = {x=10,y=100} : {x:int, y:int}


**  Atom Structure

Atom.atom is a representation of string which is fast to compare,
i.e. typically 1 instruction.

Application is typically in compilers/symbolic processors where you
want to look up strings often. In the compiler, this usually comes
up in symbol table lookups.

If s₁ and s₂ are two strings such that a₁ = atom s₁ and a₂ = atom s₂ then

1. same (a₁, a₂) if and only if s₁ == s₂ (however it is expected that
   same (a₁, a₂) will be faster


2. compare (a₁, a₂) need not be the same as compare(s₁, s₂). However
   the ordering that one gets via compare (a₁, a₂) should give a total
   ordering.


#+begin_src sml
  open Atom
  val x = atom "hello"
  val y = atom "world"


  datatype var Expr = Const of int
                    | Plus of Expr * Expr
                    | Var of v

  (* Internal expression, i.e. the representation of expression used inside the compiler *)
  type IExpr = Atom.atom Expr

  type UExpr = string Expr (* Expression as seen by the user of the compiler *)

  type 'value Env = 'value AtomMap.map  (* A key value store where the keys are atoms *)

  (* fun eval (env : int Env) (e : IExpr) = ... *)


#+end_src

#+RESULTS:
#+begin_example
[autoloading]
[autoloading done]
opening Atom
  type atom
  val atom : string -> atom
  val atom' : substring -> atom
  val toString : atom -> string
  val same : atom * atom -> bool
  val sameAtom : atom * atom -> bool
  val compare : atom * atom -> order
  val lexCompare : atom * atom -> order
  val hash : atom -> word
val x = - : atom
val y = - : atom
datatype Expr = Const of int | Plus of Expr * Expr | Var of atom
type 'a Env = 'a AtomRedBlackMap.map
#+end_example



** Implementation of Atom

#+begin_src sml
   fun hash_string (x : string) : int = 0  (* A good hash function *)
   signature ATOM = sig
     type atom
     val atom : string -> atom
     val toString : atom -> string
     val compare  : atom * atom -> order
   end

   structure Atom1 :> ATOM = struct
      type atom               = { hashcode : int , symbol : string }
      fun atom x              = { symbol = x , hashcode = hash_string x }

      (* If hash_string is a good hash function then very likely
         the hash values of different strings are different *)


      fun toString (a : atom) = #symbol a
                                      (* Note that toString (atom x) = x *)
      fun compare (a1 : atom , a2 : atom)  =
          case Int.compare  (#hashcode a1 , #hashcode a2) of
               EQUAL => String.compare ( #symbol a1 , #symbol a2)
             | x     => x

                                      (* The comparison is fast  because it is int comparison *)
   end


  (*
    Benign side effect, i.e observationally pure computation *)

   structure Atom2 :> ATOM = struct

      type atom               = { hashcode : int , symbol : string }


      val counter = ref 0    (* We have a counter which will be used to assign hash codes *)
      val ht : atom StringHashTable.hash_table = IntHashTable.mkTable (100, exn)

      fun mkAtom x              = let val cur = !counter
                                      val atm = { symbol = x , hashcode = cur }
                                  in counter := cur + 1;
                                     StringHashTable.insert ht (x, atm);
                                     atm
                                  end

      fun atom x = case StringHashTable.find ht x of
                       NONE => mkAtom x
                    | SOME a => a


      fun toString (a : atom) = #symbol a
                                      (* Note that toString (atom x) = x *)
      fun compare (a1 : atom , a2 : atom)  = Int.compare  (#hashcode a1 , #hashcode a2)

                                      (* The comparison is fast  because it is int comparison *)
   end



#+end_src

#+RESULTS:
#+begin_example
val hash_string = fn : string -> int
signature ATOM =
  sig
    type atom
    val atom : string -> atom
    val toString : atom -> string
    val compare : atom * atom -> order
  end
structure Atom1 : ATOM
structure Atom2 : ATOM
#+end_example


** Monotypes

I will use τ with possible subscripts to denote mono-types. This is
exactly like types in the simply typed lambda calculus but for type
variables.

#+begin_example

τ := b          b ∈ B the set of basic type
  |  α          α ∈ Type variable  (in addition to what you have for simply-typed calculus)
  |  τ₁ -> τ₂   where τ₁ and τ₂ are mono-types.

#+end_example

- Point of confusion :: In SML, when I write a type containing type
  variables you immediately think of the associated type scheme where
  all the type variables are quantified. In other words there are no
  mono-types with type free type variables in the SML top level.

  When talking about type inference algorithm and rules we need to be
  more precise on this. So only when type variables are quantified are
  the types considerd poly types (type schemes is a better word)
  otherwise they are treated as mono-types.

  #+begin_src sml

     fun foo x = let val y = (x,x)
                 in
                     (y,y)
                 end

    (*  Figuring out the type of foo.

        Start by an assumption x : nat
        See that in the rhs the type y : nat * nat
        and hence (y,y) is of type (nat * nat) * (nat * nat)

        and hence foo : nat -> (nat * nat) * (nat * nat)

        This is how one would have infered the type of foo in
        simply-typed lambda calculus

       If I had started with the assumption x : bool I would have ended
       with foo : bool -> (bool * bool) * (bool * bool)

       If I had started with the assumption x : α, whatever mono-type it
       is, I would have ended with foo : α -> (α * α) * (α * α)


       Let α be any type in the simply-typed lambda calculus.

        Starting by an assumption x : α

        See that in the rhs the type y : α * α
        and hence (y,y) is of type (α * α) * (α * α)

       (fixed but arbitrary)

     ,*)

  #+end_src

  #+RESULTS:
  : val foo = fn : 'a -> ('a * 'a) * ('a * 'a)

  In the language of Hindley-Milner type system I should really be saying

  ~foo : ∀ α . α -> (α * α) * (α * α)~ which is a type-scheme and not a mono-type.


** Informal description.

#+begin_src  sml


  val foo = fn x => fn y => x

  (*

   The algorithm should figure out that foo : σ where the judgement ⊢ foo : σ should be
   derivable from the rules of typing.

  1. We first figure out a τ such that foo : τ and Closure(τ) is the most general type
     that we can assign to foo.

     Closure(τ) = ∀ α₁ ... ∀ αₙ . τ  where FV(τ) = { α₁ ... αₙ }



   Let us pick a fresh variable α



   1. ...
   2. ...
   3. .....
      { x : α₁ } ⊢ e : β
      =====================
      foo = λ x . e : α₁ -> β


  ,*)


#+end_src

#+RESULTS:
: val foo = fn : 'a -> 'b -> 'a

~foo : ∀ α ∀ β . α -> β -> α~


*** Static type checking

- Advantages ::

1. Errors are caught before deployment.
2. More efficient code is expected out of static type checking

- Disadvantages ::

1. Very verbose type declarations.
2. Not easy to prototype

These complaints are because of languages like Java.

SML has this nice property that it can infer the types.

#+BEGIN_SRC sml

fun add x y = x + y

#+END_SRC

#+RESULTS:
: val add = fn : int -> int -> int

** Strong types are good

Write a function to compute the average of two real numbers.

#+BEGIN_SRC C
# include <stdio.h>
double av( double x , double y)
{
   return 1/2 * (x + y);
}

int main ()
{
   printf("the result is %g\n", av(2,3));
}


#+END_SRC

#+RESULTS:
: the result is 0

The bug is due to the automatic conversion from
integers to double.

#+BEGIN_SRC sml

fun av x y = 1.0/2.0 * (x + y)


#+END_SRC

#+RESULTS:
: val av = fn : real -> real -> real



** What are types

- Basic types :: ~int~, ~bool~, ~char~, ~string~

#+BEGIN_SRC sml
val anInt = 10
val aBool = true
val anotherBool = false
val aChar = #"c"
val aString = "hello\n"

#+END_SRC

- Compound types :: product types, lists etc

#+BEGIN_SRC sml
val y = (1, "hello")
val y1 = (1,true, "hello")
val x  = #1 y
val h =  #2 y
val z = [1,2,3]
val z1 = [ "hello", "world"]
val u = 2 :: z
val u1 = []
val u2 = "foo" :: z1
fun bar x (y : real) = x + y
fun bar1 x y = (x+1,y)

(*
 A * B  is the type of all tuples (a,b) where a : A and b : B.

'a , 'b , 'c  --> type variables

A -> B denotes the type of functions from A to B

Functions whose range is B and domain is A

*)
#+END_SRC

#+RESULTS:
#+begin_example
val y = (1,"hello") : int * string
val y1 = (1,true,"hello") : int * bool * string
val x = 1 : int
val h = "hello" : string
val z = [1,2,3] : int list
val z1 = ["hello","world"] : string list
val u = [2,1,2,3] : int list
val u1 = [] : 'a list
val u2 = ["foo","hello","world"] : string list
val bar = fn : real -> real -> real
val bar1 = fn : int -> 'a -> int * 'a
#+end_example



- Polymorphism :: SML figures out the most general possible type.
This kind of polymorphism is called parametric polymorphism


*** Reductions/simplifications

#+BEGIN_SRC sml

fun increment x = x + 1
(* the variable increment is bound to that function which on input x gives x + 1 *)
val x = 10
val z = increment (2 + x)

fun foo (x,y) = x + y

fun bar () () = ()

val u = bar (print "hello\n")


(*
    f            e
    increment (2 + x) ---> increment (2 + x)
                     ---> increment (2 + 10)
                     ---> increment 12 ----> bind x to 12 and evalute (x + 1 )
                     ---> 12 + 1
                     ---> 13
                       match it with the lhs (identity x) which binds x to 12
    (1) reduce f
    (2) reduce e
    (3)

Eger evaluation: Arugments are reduced before functions are applied.
lazy evaluation: Arugments are evaluated only when needed.

*)

#+END_SRC

#+RESULTS:
: hello
: val increment = fn : int -> int
: val x = 10 : int
: val z = 13 : int
: val foo = fn : int * int -> int
: val bar = fn : unit -> unit -> unit
: val u = fn : unit -> unit

1. First the RHS is reduced to a value and then
   bound to x

2. During evaluation if a variable is found then
   its corresponding bound value is substituted

** More types

1. Types i.e basic types like ~int~, ~real~, ~string~
2. Cartesian produce ~int * real~
3. Function types ~int -> string~
4. Polymorphism ~'a -> 'b -> 'a~
5. Type aliasing

#+BEGIN_SRC sml

type complex = real * real
val x : complex = (2.0, 1.0)

fun realpart (a:real, b:real) = a
val z = realpart x
(*
 complex is just a new name for real * real.
As types they are the same.

*)
#+END_SRC

#+RESULTS:
: type complex = real * real
: val x = (2.0,1.0) : complex
: val realpart = fn : real * real -> real
: val z = 2.0 : real

** Algebraic type.

#+BEGIN_SRC sml

datatype Day = Sun
             | Mon
             | Tue
             | Wed
             | Thu
             | Fri
             | Sat

(* If SML did not have booleans *)
datatype Bool = True
              | False

(* how to define a value of type Day *)
val x = Sun

(* how to write functions *)

(*

Write a function isHoliday : Day -> bool

1. d : Day
2. ... : bool

*)
fun isHoliday Sun = true
  | isHoliday Sat = true
  | isHoliday _   = false


(*


isHoliday Mon  ---->
  Try in this order

  1. match isHoliday Sun with isHoliday Mon ---> true
  2. match isHoliday Sat with isHoliday Mon ---> true
  3. match isHolida  _   with isHoliday Mon ---> false


*)
(*

This is not like enum of C or C++ because
there is not automatic conversion from enum
to int and vice-versa

*)

#+END_SRC

#+RESULTS:
: stdIn:107.5-107.25 Warning: match nonexhaustive
:           Sun => ...
:
: datatype Day = Fri | Mon | Sat | Sun | Thu | Tue | Wed
: datatype Bool = False | True
: val x = Sun : Day
: val isHoliday = fn : Day -> bool

#+BEGIN_SRC sml

val x = SOME 10
val y = NONE

(*

head is a function that takes a list and
produces the first element of the list.

head : 'a list -> 'a

head is not defined on empty list
THis will be a runtime bug because

head e

headSafe : 'a list -> 'a option


datatype 'a option = SOME of 'a
                   | NONE


print : string -> ()

*)

datatype 'a Option = Some of 'a
                   | None

fun head (x :: _) = x

fun headSafe (x :: _) = SOME x
  | headSafe _        = NONE


val foo = head [1,2,3]
val bar = headSafe []
val _   = print (head ["foo" , "bar" ])
val _   = print (head [])

val _   = print (headSafe ["foo", "bar"])
#+END_SRC

#+RESULTS:
: stdIn:233.5-233.22 Warning: type vars not generalized because of
:    value restriction are instantiated to dummy types (X1,X2,...)
: stdIn:237.5-237.42 Error: operator and operand don't agree [tycon mismatch]
:   operator domain: string
:   operand:         string option
:   in expression:

#+BEGIN_SRC C

int main ()
{
  FILE *fp;
  if ( fp = fopen("hello"))  == NULL)
  {
     /*
      handle the fact that there is no hello file */
  }
  ... stuff with fp

}

#+END_SRC
** Abstract syntax of the language

This is a term used mainly in programming language theory.

- Parse tree  - compiler literature
- Abstract syntax tree

Consider the language of expressions with + and * and constants (integers)

#+BEGIN_EXAMPLE
1 + 2 * 3

(1 * 2) + 3

(1 + 2) * 3

1 +   -- not an expression
1 3   -- not an expression

(1 + 2) 3 -- not an expression

#+END_EXAMPLE

- Concrete syntax ::

1. Governs what string/text is valid program
2. We want to know "how" the string is a member of the language. x ∈ L
3. We need ways to ensure that the grammar is unambiguous
4. Used to convert from "textual" representation of
   the program to .... abstract syntax or parse trees


#+BEGIN_EXAMPLE

E -> nat    -- nat rule
  |  E + E  -- plus rule
  |  E * E  -- mul rule   has more precedence
  | ( E )   -- paren rule


Proof that 1 + 2 * 3 is an E  --- 1 + {2 * 3}

(1) 1 is an E  (nat rule)
(2) 2 is an E  (nat rule)
(3) 3 is an E  (nat rule)
(4) 2 * 3 is an E (mul using 2,3)
(5) 1 + 2 * 3 is an E (plus using 1,4)


Proof that 1 + 2 * 3 is an E   {1 + 2} * 3

(1) 1 is an E  (nat rule)
(2) 2 is an E  (nat rule)
(3) 3 is an E  (nat rule)
(4) 1 + 2 is an E (plus using 1,2)
(5) 1 + 2 * 3 is an E (mul using 3,4)

#+END_EXAMPLE


Expressing expressions as trees will not have a problem of ambiguity.

#+BEGIN_EXAMPLE

         1 + {2 * 3}          {1 + 2} * 3

             +		           *
            / \		          / \
           1   * 		       	 +   3
              / \		      	/ \
             2   3	               1   2


#+END_EXAMPLE


- Abstract syntax ::

#+BEGIN_EXAMPLE

E -> nat
   | E + E
   | E * E

#+END_EXAMPLE

1. A nat is an expression

2. If E1 and E2 are expressions then E1 + E2 is an expression

3. If E1 and E2 are expressions then E1 * E2 is expression

#+BEGIN_SRC sml
datatype expr = Const of int
              | Plus  of expr * expr
              | Mul   of expr * expr


fun exprDenote (Const x)      = x
  | exprDenote (Plus (e1,e2)) = exprDenote e1 + exprDenote e2
  | exprDenote (Mul (e1,e2))  = exprDenote e1 * exprDenote e2

(* instruction of a stack machine *)
datatype inst = push of int
              | plus
              | mul


(*

push x :  pushes x on top of the stack

plus : x1 = pop x2 = pop ; push (x1 + x2)

mul  : x1 = pop x2 = pop ; push (x1 * x2)


*)
type executable = inst list

type stack = int list

(* instDenote : inst -> stack -> stack *)
fun instDenote (push x) stk                 = x :: stk
  | instDenote plus     (x1 :: x2 :: stk)   = x1 + x2 :: stk
  | instDenote mul      (x1 :: x2 :: stk)   = x1 * x2 :: stk

fun interp prog stk = fold....

(* compile : expr -> executable *)
fun compile (Const x)       = [push x]
  | compile (Plus (e1,e2))  = let val prog1 = compile e1
                                  val prog2 = compile e2
                              in
                                 prog2 @ prog1 @ [plus]
                              end

  | compile (Mul  (e1,e2))  = let val prog1 = compile e1
                                  val prog2 = compile e2
                              in
                                 prog2 @ prog1 @ [mul]
                              end

val one = Const 1
val two = Const 2
val three = Const 3
val x = Plus (Plus (one, two), three)
val p1 = compile x
#+END_SRC

#+RESULTS:
: datatype expr = Const of int | Mul of expr * expr | Plus of expr * expr
: datatype inst = mul | plus | push of int
: type executable = inst list
: val compile = fn : expr -> inst list
: val one = Const 1 : expr
: val two = Const 2 : expr
: val three = Const 3 : expr
: val x = Plus (Plus (Const #,Const #),Const 3) : expr
: val p1 = [push 3,push 2,push 1,plus,plus] : inst list

Abstract syntax

1. Only captures the essence of the syntax
2. Brackets and other disambiguation things can be removed.


#+BEGIN_EXAMPLE

S -> nat
  |  nat , S

#+END_EXAMPLE

#+BEGIN_SRC sml

type commaSepNat = int list

#+END_SRC
** Main Idea

Main idea :: Control the name-space of definitions.

1. Possibly multiple instances of name vs value binding

2. Together with functor it gives powerful way of manipulating name space.
#+BEGIN_SRC sml

val x = 10
val x = "hello"

structure A = struct
   val  x   = 10
   type foo = int
end
(*

Modules in ocaml.

*)

val y = A.x
fun myfun (x : A.foo) = x + 1

open A (* generaly discouraged *)
fun myanotherfun (x : foo) = x + 1

val u = List.map myfun [1,2,3]

#+END_SRC

#+RESULTS:
#+begin_example
val x = <hidden-value> : int
val x = <hidden-value> : string
structure A :
  sig
    val x : int
    type foo = int
  end
val y = 10 : int
val myfun = fn : foo -> int
opening A
  val x : int
  type foo = int
val myanotherfun = fn : foo -> int
val u = [2,3,4] : int list
#+end_example

Caution

1. Do not confuse this with structures in C. In C structs are just
   product types which in SML is called records.

2. Similar to namespace in C++

** Signatures


1. Signatures can used to control what is exposed from a structure.

2. Signatures itself can be defined and used

3. Signature is used in functors to control what structures are expected to have.


#+BEGIN_SRC sml

signature MYSIG = sig
   type foo
   val  x : foo
 end

structure A : MYSIG

(* sig
   val x : int
   type foo
  end *) =  struct

val x = 10
val y = 100
type foo = int
type bar = string
end

val y = A.x  (* this is fine *)
(* val z = A.y  (* not fine as y is not exposed *) *)


structure B : MYSIG = struct

  type foo = string
  val x    = "hello"

end

#+END_SRC

#+RESULTS:
: signature MYSIG =
:   sig
:     type foo
:     val x : foo
:   end
: structure A : MYSIG
: val y = 10 : foo
: structure B : MYSIG


** Functors take structures and produce other structure.

#+BEGIN_SRC sml

datatype CMP = LT | GT | EQ

signature ORD = sig
  type t
  val compare : t -> t -> CMP
end


structure IntOrd : ORD = struct
  type t = int
  fun compare x y = ...
end


functor Invert ( O : ORD ) = struct
   type t = O.t
   fun compare x y = O.compare y x
end

struct InvIntOrd = Invert (IntOrd)

functor Sort (O : ORD) = struct
   fun sort (xs : O.t list) = ....

end

#+END_SRC

#+RESULTS:
#+begin_example
datatype CMP = EQ | GT | LT
signature ORD =
  sig
    type t
    val compare : t -> t -> CMP
  end
functor Invert(O: sig
                    type t
                    val compare : t -> t -> CMP
                  end) :
              sig
                type t
                val compare : O.t -> O.t -> CMP
              end
#+end_example


** Some interesting libraries

1. Look for utility functions in the Standard Basis library

#+BEGIN_SRC sml

open Array

val myintarray = array (10, 42)
val mystrarray = array (10, "The answer is")
val _ = update (myintarray, 0, 100)

#+END_SRC

#+RESULTS:
#+begin_example
opening Array
  type 'a array = 'a ?.array
  type 'a vector = 'a ?.vector
  val maxLen : int
  val array : int * 'a -> 'a array
  val fromList : 'a list -> 'a array
  val tabulate : int * (int -> 'a) -> 'a array
  val length : 'a array -> int
  val sub : 'a array * int -> 'a
  val update : 'a array * int * 'a -> unit
  val vector : 'a array -> 'a vector
  val copy : {di:int, dst:'a array, src:'a array} -> unit
  val copyVec : {di:int, dst:'a array, src:'a vector} -> unit
  val appi : (int * 'a -> unit) -> 'a array -> unit
  val app : ('a -> unit) -> 'a array -> unit
  val modifyi : (int * 'a -> 'a) -> 'a array -> unit
  val modify : ('a -> 'a) -> 'a array -> unit
  val foldli : (int * 'a * 'b -> 'b) -> 'b -> 'a array -> 'b
  val foldri : (int * 'a * 'b -> 'b) -> 'b -> 'a array -> 'b
  val foldl : ('a * 'b -> 'b) -> 'b -> 'a array -> 'b
  val foldr : ('a * 'b -> 'b) -> 'b -> 'a array -> 'b
  val findi : (int * 'a -> bool) -> 'a array -> (int * 'a) option
  val find : ('a -> bool) -> 'a array -> 'a option
  val exists : ('a -> bool) -> 'a array -> bool
  val all : ('a -> bool) -> 'a array -> bool
  val collate : ('a * 'a -> order) -> 'a array * 'a array -> order
  val toList : 'a array -> 'a list
  val fromVector : 'a vector -> 'a array
  val toVector : 'a array -> 'a vector
val myintarray = [|100,42,42,42,42,42,42,42,42,42|] : int array
val mystrarray =
  [|"The answer is","The answer is","The answer is","The answer is",
   "The answer is","The answer is","The answer is","The answer is",
   "The answer is","The answer is"|] : string array
#+end_example

2. Additional utility functions and libraries are available as part
   of the SML of NL library. This is also available in mlton

** Unique value creation

1. Not Globally unique but unique in a particular run of the computation.


#+BEGIN_SRC sml

datatype order = LESS | GREATER | EQUAL

signature UNIQUE = sig

   type uniq

   val new : unit -> uniq

end

(* opaque signature *)
structure Unique :> UNIQUE = struct
  type uniq = int

  val uniqRef = ref 0

  (* wrong implementation *)
  fun new () = 10 (* fixme *)



end

val x = Unique.new ()
(* val y = [x, 42] *)



(* Problem: Nothing gurantees that all the unique
   values that I created in the program is via Unique.new ()
 *)


#+END_SRC

#+RESULTS:
: datatype order = EQUAL | GREATER | LESS
: signature UNIQUE =
:   sig
:     type uniq
:     avl new : unit -> uniq
:   end
: structure Unique : UNIQUE
: val x = - : Unique.uniq


2. Atom implementation

A representation for variables in programs.

#+BEGIN_SRC sml

signature ATOM = sig

   type atom

   val atom  : string -> atom
   val toString : atom -> string

   val compare : atom * atom -> order

....
end

structure Atom :> ATOM = struct

   type atom = int

   val atomRef = ref 0

   (*
   1. A referencce to map from int (atom) -> string

   2. A reference to a map from string -> int (atom)

   *)

   type toStringMap = string IntRedBlackMap.map
   type atomMap     = atom StringRedBlackMap.map

   val toStringRef : ref toStringMap = ref IntRedBlackMap.empty
   val atomMap     : ref atomMap     = StringRedBlackMap.empty

   fun atom str = let val toStrMP = !toStringRef
                   (* loopkup the given str in toStrMP
                      1. It is already there in which case return the associated atom (int)
                      2. otherwise increment atomRef and assign str to this new value
                    *)

   fun toString atm = lookup
end

#+BEGIN_SRC sml

(* int -> int *)

val const ( _ : int) = 0
val incr x = x + 1


(* Given a function of type 'a -> 'a, 'a -> 'b -> 'a , int -> b -> int  *)

fun foo x = x

#+END_SRC

Benign side effect :: A side effectful computation that can be treated
like a pure computation The atom and toString functions of the Atom
structure look pure outside the structure although internally they
have side effect.


#+END_SRC
** Local declarations (non-recursive let).


#+BEGIN_SRC sml
fun foo x = let val y = x + 1
            in y * x
            end

#+END_SRC

#+RESULTS:
: val foo = fn : int -> int

#+BEGIN_EXAMPLE

let v = e1
in e2

===

(λ v . e2) e1

(fn v => e2) e1

....x = .. (let x = e1 in e2) ....

   The x in the expression e1 will be coming from
the outside scope

#+END_EXAMPLE

One can think of ~let v = e1 in e2~ as a syntactic sugar for
~(λ v . e2) e1~


Non-recursive let explanation
#+BEGIN_EXAMPLE

      <-----------
                 |
        (let x = x + 1 in .... x ...)
             ^                 |
             +-----------------+


  (let x = 5
     in
       let x = x + 1  (* this binds x to 5 + 1 = 6 *)
          in x        (* x here is 6 *)
       end
     end
  )

  This entire expression evaluates to 6
#+END_EXAMPLE

In OCAML there is ~let~ and ~let rec~

*** Fix points gives recursion.

1. letrec f x = ... f y .... in e

   F = λ f x . .....f y .....

#+BEGIN_SRC sml

fun fact n = if n <= 0 then 1
             else n * fact (n - 1)

val y = fact 4 (* this is just to check fact *)


fun F f n = if n <= 0 then 1 else n * f (n - 1) (* notice there is no recursion *)

val G = fn f => fn n => if n <= 0 then 1 else n * f (n - 1)

#+END_SRC

#+RESULTS:
: val fact = fn : int -> int
: val y = 24 : int
: val F = fn : (int -> int) -> int -> int
: val G = fn : (int -> int) -> int -> int
                  A               A

#+BEGIN_EXAMPLE

fact = λ n . if n <= 0 then 1 else n * fact (n - 1)

We want fact to be a solution of the above recursion


F = λ f . λ n . if n <= 0 then 1 else n * f (n - 1)

g is the fixpoint of F

This means g satisfies the recursion

   g = F g

g = (λ f . λ n . if n <= 0 then 1 else n * f (n - 1)) g
  = λ n . if n <= 0 then 1 else n * g (n - 1)

Solution of the recursion
 f = M (f)
 is the fixpoint of  λ f . M (f)

#+END_EXAMPLE

1. What is the fixpoint of ~F~ if it exists ?

   The fixpoint of ~F~ is that ~X~ such that ~F X = X~.

   ~F X is fn n => if n <= 0 then 1 else n * X (n - 1)~

   ~F X = X~ means ~X = F X~ which means

   ~X = fn n => if n <= 0 then 1 else n * X (n - 1)~
   ~fact = fn n => if n <= 0 then 1 else n * fact (n - 1)~

2. The recursive function definition ~fact~ is nothing but the fixpoint of
   The function ~F = fn f => fn n => if n <= 0 then 1 else n * f (n - 1)~


3. Notice that ~F~ is not recursive but its fixpoint is the solution to
   the recursive equation for ~fact~.

*** Abstraction

#+BEGIN_EXAMPLE

Γ ∪ { x : τ₁ } ⊢ e : τ₂
========================================
Γ              ⊢ (λ x : τ₁ . e)  : τ₁ → τ₂

#+END_EXAMPLE


Γ ∪ {A } ⊢ B
================
Γ ⊢ A → B



Suppose I want to prove assuming Γ that  A => B. It is sufficient to prove B assuming A (and Γ)


λ x : τ₁ . e  is that function that takes x : τ₁ and gives out e : τ₂



A ∨ B


#+BEGIN_EXAMPLE

Γ ⊢ A
========

Γ ⊢ A ∨ B


Γ ⊢ B
========

Γ ⊢ A ∨ B


Γ ⊢ A -> C
Γ ⊢ B ->  C
=================
Γ ⊢  A ∨ B ->  C


#+END_EXAMPLE


#+BEGIN_SRC sml

(* or of logic *)
datatype ('a, 'b) Sum = left of 'a
                      | right of 'b


fun either f g (left a) = f a
  | either f g (right b)= g b

(* like the and of logic *)
type ('a,'b) prod = 'a * 'b


#+END_SRC

#+RESULTS:
: datatype ('a,'b) Sum = left of 'a | right of 'b
: val either = fn : ('a -> 'b) -> ('c -> 'b) -> ('a,'c) Sum -> 'b


#+BEGIN_EXAMPLE

Γ ⊢ e : 'a
===========================
Γ ⊢ left e : ('a , 'b) Sum


Γ ⊢ f : 'a -> 'c
Γ ⊢ g : 'b -> 'c
==================
Γ ⊢ either f g : ('a,'b) Sum -> 'c

#+END_EXAMPLE


